# RNN

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, LSTM, Dropout
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

In [10]:
data = pd.read_csv('RNN.csv')

In [11]:
data

   S.no  Lst year Fees  CGPA   Fees
0     1          10000   7.5  15000
1     2          20000   6.0  13000
2     3         100000   8.5  50000
3     4          65000   8.6  85750

In [12]:
x=data.drop('Fees',axis=1)
y=data['Fees']

In [13]:
x

   S.no  Lst year Fees  CGPA
0     1          10000   7.5
1     2          20000   6.0
2     3         100000   8.5
3     4          65000   8.6

In [14]:
y

0    15000
1    13000
2    50000
3    85750
Name: Fees, dtype: int64

In [15]:
scaler_x=MinMaxScaler()
scaler_y=MinMaxScaler()